//---------------------------------------------------------
// автор коду Едуард Любарець Максимович РЕ-41
// виконано в рамках навчальної дисципліни РТФ
// Підсумкова робота: математичні операції, двовимірні динамічні масиви, робота з файлами
// крайній реліз 16.06.2025
//---------------------------------------------------------

#pragma once
#include<stdlib.h>
#include<stdio.h>
#include<math.h>

//математична функція
//обчислює значення за заданою формулою n=0,∑(-1)^n * (a^(2n + 1))/(2n+1)!
//не використовуючи елементарних математичних функцій
//не повертає значення
void firstTaskFunction(double a, unsigned int N);

//функція, що ініціалізує та сортує двовимірний массив в заданому діапазоні значень
//не повертає значення
void secondTaskFunction(int N);

//функція, що рахує кількість зазначених символів у вказаному файлі відповідно завдання №3
//не повертає значення
void thirdTaskFunction(char* fileName, char* s);
