//---------------------------------------------------------
// автор коду Едуард Любарець Максимович РЕ-41
// виконано в рамках навчальної дисципліни РТФ
// Робота з файлами
// крайній реліз 16.06.2025
//---------------------------------------------------------

#pragma once
#include<stdlib.h>
#include<stdio.h>
#include<math.h>

// математична функція
// обчислює значення відповідно заданої формули
// повертає значення типу double
// має один параметр
double myFunction(x);

// функція типу void
// не повертає значення
// зчитує дані з файлу з умовою
// має 4 параметри
void readTaskData(char* fileName, double* x1, double* x2, double* delta);

// функція типу void
// не повертає значення
// виводить таблицю з результатом обчислень у консоль
// має 3 параметри
void printResultConsole(double x1, double x2, double delta);

// функція типу void
// не повертає значення
// створює текстовий файл та записує у нього таблицю з результатом обчислень
// має 4 параметри
void createTextFile(double x1, double x2, double delta, char* fileCatalog);

// функція типу void
// не повертає значення
// створює бінарний файл та записує у нього масив з результатом обчислень
// має 4 параметри
void createBinaryFile(double x1, double x2, double delta, char* fileCatalog);

// функція типу void
// не повертає значення
// зчитує дані з бінарного файлу та виводить їх у консоль
// має 1 параметр
void readPrintBinaryData(char* fileCatalog);

